app/Controllers/Register.php

        $fotoName = $foto->getRandomName();
        $foto->move('assets/images/user/', $fotoName);
        if ($foto->hasMoved()) {
            $dtUser = $this->ModelUser->where('email', session('token'))->first();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'j@g.c'

            ];

            $modelDetailPemilik = new ModelDetailPemilik();
            if ($modelDetailPemilik->insert($dt)) {
---
INSERT INTO `tbl_detail_pemilik` (`nama_lengkap`, `telepon`, `jk`, `alamat`, `foto`, `id_user`) VALUES ('Jumbleng Adi', '12345678909', 'Laki-laki', 'Gambarwi, Sewurejo, Mojogedang', '1672566822_a32e8d7bd1e52ad6dbfa.jpg', '25')